#!/bin/bash

rootCAkey=rootCA.key 
rootCApem=rootCA.pem
clientkey=client.key
clientcsr=client.csr
clientpem=client.pem
keystore=keystore.p12

service_ip=127.0.0.1
service_Country=UA
service_State=Ukraine
service_City=Kyiv
service_Organization=eGA

echo "******************************************************************************
*                  Создаємо власний Certificate Authority
******************************************************************************"

if [ -f ./$rootCAkey ]; then
	echo "власний Certificate Authority вже існує"
else 
	openssl genrsa -des3 -out $rootCAkey 2048
fi

echo "******************************************************************************
*                  Створюємо відкритий сертифікат до Certificate Authority
******************************************************************************"
if [ -f ./$rootCApem ]; then
	echo "відкритий сертифікат до Certificate Authority вже існує"
else 
	openssl req -x509 -new -nodes -key $rootCAkey -sha256 -days 3650 -out $rootCApem
fi

echo "******************************************************************************
* Вітаємо! Тепер ви є центром сертифікації та можете підписувати сертифікати для 
* інших  суб'єктів. Суб'єкт, що запитує сертифікат у центру сертифікації, повинен
* надати CA CSR, що містить інформацію про запит
******************************************************************************"


echo "******************************************************************************
*                  Створюємо закритий ключ до клієнта
******************************************************************************"
if [ -f ./$clientkey ]; then
	echo "закритий ключ до клієнта вже існує"
else 
	openssl genrsa -des3 -out $clientkey 2048
fi

echo "******************************************************************************
*                  Створюємо запит на сертифікат к СА для клієнта
******************************************************************************"
if [ -f ./$clientcsr ]; then
	echo "запит на сертифікат к СА для клієнта вже існує"
else 
	openssl req -new -sha256 -key $clientkey -out $clientcsr
fi


echo "******************************************************************************
*                  Створюємо відкритий сертифікат до нашого клієнта
******************************************************************************"
if [ -f ./$clientpem ]; then
	echo "відкритий сертифікат до нашого клієнта вже існує"
else 
	openssl x509 -req -in $clientcsr -CA $rootCApem -CAkey $rootCAkey -CAcreateserial -out $clientpem -days 3650 -sha256
fi

echo "******************************************************************************
*                  Створюємо сховище ключей сервіса
******************************************************************************"
if [ -f ./$keystore ]; then
	echo "сховище ключей сервіса вже існує"
else 
	openssl pkcs12 -export -in $clientpem -out $keystore -name myClient -nodes -inkey $clientkey
fi





